Cypherock/x1_wallet_hal_stm32/libusb/libusb.c
static void comm_rxonly (usbd_device *dev, uint8_t event, uint8_t ep) {
    uint32_t dataSize = usbd_ep_read(dev, ep, rx_buffer, LU_RX_BUF_SIZE);

    parseFun(rx_buffer, dataSize);

}

static void comm_txonly(usbd_device *dev, uint8_t event, uint8_t ep) {
     uint32_t  _t = usbd_ep_write(dev, ep, &fifo[0], (fpos < DEVICE_DATA_EP_SIZE) ? fpos : DEVICE_DATA_EP_SIZE);
     memmove(&fifo[0], &fifo[_t], fpos - _t);
     fpos -= _t;
}

static void comm_rxtx(usbd_device *dev, uint8_t event, uint8_t ep) {
    if (event == usbd_evt_eptx) {
        comm_txonly(dev, event, ep);
    } else {
        comm_rxonly(dev, event, ep);
    }
}

#if (ENABLE_HID_WEBUSB_COMM == 1)
static void loopback_rxtx(usbd_device *dev, uint8_t event, uint8_t ep){
    if (event == usbd_evt_eptx) {
        uint32_t  _t = usbd_ep_write(dev, ep, data, (data_len < DEVICE_DATA_EP_SIZE) ? data_len : DEVICE_DATA_EP_SIZE);
        memcpy(data, data + _t, data_len - _t);
        data_len -= _t;
    } else {
        uint32_t dataSize = usbd_ep_read(dev, ep, data+data_len, sizeof(data));
        data_len += dataSize;
    }
    return;
}
#endif

static usbd_respond device_setconf (usbd_device *dev, uint8_t cfg) {
    switch (cfg) {
    case 0:
        /* deconfiguring device */
        usbd_ep_deconfig(dev, DEVICE_DATA_RX_EP);
        usbd_ep_deconfig(dev, DEVICE_DATA_TX_EP);
        usbd_reg_endpoint(dev, DEVICE_DATA_RX_EP, 0);
        usbd_reg_endpoint(dev, DEVICE_DATA_TX_EP, 0);
#if (ENABLE_HID_WEBUSB_COMM == 1)
        usbd_ep_deconfig(dev, WEBUSB_RXD_EP);
        usbd_ep_deconfig(dev, WEBUSB_TXD_EP);
        usbd_reg_endpoint(dev, WEBUSB_RXD_EP, 0);
        usbd_reg_endpoint(dev, WEBUSB_TXD_EP, 0);
#endif
        return usbd_ack;
    case 1:
        /* configuring device */
        usbd_ep_config(dev, DEVICE_DATA_RX_EP, DEVICE_DATA_EP_TYPE /*| USB_EPTYPE_DBLBUF*/, DEVICE_DATA_EP_SIZE);
        usbd_ep_config(dev, DEVICE_DATA_TX_EP, DEVICE_DATA_EP_TYPE /*| USB_EPTYPE_DBLBUF*/, DEVICE_DATA_EP_SIZE);
        usbd_reg_endpoint(dev, DEVICE_DATA_RX_EP, comm_rxtx);
        usbd_reg_endpoint(dev, DEVICE_DATA_TX_EP, comm_rxtx);
        usbd_ep_write(dev, DEVICE_DATA_TX_EP, 0, 0);
#if (ENABLE_HID_WEBUSB_COMM == 1)
        usbd_ep_config(dev, WEBUSB_RXD_EP, USB_EPTYPE_INTERRUPT /*| USB_EPTYPE_DBLBUF*/, DEVICE_DATA_EP_SIZE);
        usbd_ep_config(dev, WEBUSB_TXD_EP, USB_EPTYPE_INTERRUPT /*| USB_EPTYPE_DBLBUF*/, DEVICE_DATA_EP_SIZE);
        usbd_reg_endpoint(dev, WEBUSB_RXD_EP, comm_rxtx);
        usbd_reg_endpoint(dev, WEBUSB_TXD_EP, comm_rxtx);
        usbd_ep_write(dev, WEBUSB_TXD_EP, 0, 0);
#endif
        return usbd_ack;
    default:
        return usbd_fail;
    }
}

void cdc_init_usbd(void) {
    usbd_init(&libusb_udev, &usbd_hw, 8, ubuf, sizeof(ubuf));
    usbd_reg_config(&libusb_udev, device_setconf);
    usbd_reg_control(&libusb_udev, device_control);
    usbd_reg_descr(&libusb_udev, device_getdesc);
}

#if defined(CDC_USE_IRQ)
#if defined(STM32L052xx) || defined(STM32F070xB) || \
	defined(STM32F042x6)
#define USB_HANDLER     USB_IRQHandler
    #define USB_NVIC_IRQ    USB_IRQn
#elif defined(STM32L100xC) || defined(STM32G4)
    #define USB_HANDLER     USB_LP_IRQHandler
    #define USB_NVIC_IRQ    USB_LP_IRQn
#elif defined(USBD_PRIMARY_OTGHS) && \
    (defined(STM32F446xx) || defined(STM32F429xx))
    #define USB_HANDLER     OTG_HS_IRQHandler
    #define USB_NVIC_IRQ    OTG_HS_IRQn
    /* WA. With __WFI/__WFE interrupt will not be fired
     * faced with F4 series and OTGHS only
     */
    #undef  __WFI
    #define __WFI __NOP
#elif defined(STM32L476xx) || defined(STM32F429xx) || \
      defined(STM32F105xC) || defined(STM32F107xC) || \
      defined(STM32F446xx) || defined(STM32F411xE) || \
      defined(STM32L486xx)
    #define USB_HANDLER     OTG_FS_IRQHandler
    #define USB_NVIC_IRQ    OTG_FS_IRQn
#elif defined(STM32F103x6)
    #define USB_HANDLER     USB_LP_CAN1_RX0_IRQHandler
    #define USB_NVIC_IRQ    USB_LP_CAN1_RX0_IRQn
#elif defined(STM32F103xE)
    #define USB_HANDLER     USB_LP_CAN1_RX0_IRQHandler
    #define USB_NVIC_IRQ    USB_LP_CAN1_RX0_IRQn
#else
    #error Not supported
#endif

void USB_HANDLER(void) {
    usbd_poll(&libusb_udev);
}

void libusb_init(void) {
    cdc_init_usbd();

    NVIC_EnableIRQ(USB_NVIC_IRQ);
    usbd_enable(&libusb_udev, true);
    usbd_connect(&libusb_udev, true);
}
#else
void libusb_init(void) {
    cdc_init_usbd();
    usbd_enable(&libusb_udev, true);
    usbd_connect(&libusb_udev, true);
    // Need to add a call to usbd_poll() in the event loop
}
#endif

void lusb_write(const uint8_t *data, const uint16_t size) {
    memcpy(fifo, data, size);
    fpos = size;
}

void lusb_register_parserFunction(libusb_parser_fptr_t func) {
	parseFun = func;
}
